Revit 2026 API

# ScheduleSortOrder Enumeration

---

Options for sort order of rows in a schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScheduleSortOrder
```
```vb
Public Enumeration ScheduleSortOrder
```
```cpp
public enum class ScheduleSortOrder
```
```fsharp
type ScheduleSortOrder
```

| Member name | Value | Description |
| --- | --- | --- |
| Ascending | 0 | Sort in ascending order. |
| Descending | 1 | Sort in descending order. |

#### Reference

Autodesk.Revit.DB Namespace